feaser/openblt/stm32u5_port/Target/Demo/TRICORE_TC3_TC375_Lite_Kit_ADS/Boot/Libraries/iLLD/TC37A/Tricore/Asclin/Lin/IfxAsclin_Lin.h
#define IFXASCLIN_LIN_SEND_RESPONSE    (0x80)

#define IFXASCLIN_LIN_RECEIVE_RESPONSE (0xC1)

/******************************************************************************/
/*--------------------------------Enumerations--------------------------------*/
/******************************************************************************/

/** \addtogroup IfxLld_Asclin_Lin_Enumerations
 * \{ */
/** \brief Defines the type of Lin Master Frame.
 * (Transmit Header only) or
 * (Transmit Header and Response) or
 * (Transmit Header and Receive Response).
 */
typedef enum
{
    IfxAsclin_Lin_Direction_TransmitHeader                   = 0, /**< \brief Transmit Header */
    IfxAsclin_Lin_Direction_TransmitHeaderAndResponse        = 1, /**< \brief Transmit both Header and Response */
    IfxAsclin_Lin_Direction_TransmitHeaderAndReceiveResponse = 2  /**< \brief Transmit Header and Receive Response */
} IfxAsclin_Lin_Direction;

/** \} */

/******************************************************************************/
/*-----------------------------Data Structures--------------------------------*/
/******************************************************************************/

/** \addtogroup IfxLld_Asclin_Lin_DataStructures
 * \{ */
/** \brief Structure to store interrupts which are enabled during initialisation.
 */
typedef struct
{
    uint16 rxReceivedHeader : 1;                /**< \brief Received Header */
    uint16 rxReceivedResponse : 1;              /**< \brief Received Response */
    uint16 txTransmittedHeader : 1;             /**< \brief Transmitted Header */
    uint16 txTransmittedResponse : 1;           /**< \brief Transmitted Response */
    uint16 exBreakDetected : 1;                 /**< \brief Break Detected */
    uint16 exTransmissionCompleted : 1;         /**< \brief Transmission Completed */
    uint16 exHeaderTimeout : 1;                 /**< \brief Header Timeout */
    uint16 exResponseTimeout : 1;               /**< \brief Response Timeout */
    uint16 exLinParityError : 1;                /**< \brief Lin Parity Error */
    uint16 exLinAutobaudDetectionError : 1;     /**< \brief Lin Autobaud Detection Error */
    uint16 exLinChecksumError : 1;              /**< \brief Lin Checksum Error */
    uint16 exFramingError : 1;                  /**< \brief Framing Error */
    uint16 exCollisionDetectionError : 1;       /**< \brief Collision Detection Error */
    uint16 exReceiveFIFOOverflow : 1;           /**< \brief Receive FIFO Overflow */
    uint16 exTransmitFIFOOverflow : 1;          /**< \brief Transmit FIFO Overflow */
} IfxAsclin_Lin_EnabledInterrupts;

/** \brief Structure for Lin Frame Control flags
 */
typedef struct
{
    uint16 txSendHeaderOnly : 1;            /**< \brief Flag indicating that only Header is transmitted */
    uint16 txSendResponse : 1;              /**< \brief Flag to indicate Response is transmitted */
    uint16 txHeaderInProgress : 1;          /**< \brief Flag to indicate Header transmission is initiated and is in progress */
    uint16 txResponseInProgress : 1;        /**< \brief Flag to indicate Response transmission is initiated and is in progress */
    uint16 rxHeaderInProgress : 1;          /**< \brief Flag to indicate Header reception is initiated and is in progress */
    uint16 rxResponseInProgress : 1;        /**< \brief Flag to indicate Response reception is initiated and is in progress */
    uint16 txHeaderErrorOccurred : 1;       /**< \brief Flag to indicate error occurred during transmission of Header */
    uint16 txResponseErrorOccurred : 1;     /**< \brief Flag to indicate error occurred during transmission of Response */
    uint16 rxHeaderErrorOccurred : 1;       /**< \brief Flag to indicate error occurred during reception of Header */
    uint16 rxResponseErrorOccurred : 1;     /**< \brief Flag to indicate error occurred during reception of Response */
} IfxAsclin_Lin_FrameControlFlags;

/** \} */

/** \addtogroup IfxLld_Asclin_Lin_DataStructures
 * \{ */
/** \brief Structure for Acknowledgement Flags
 */
typedef struct
{
    uint8 txHeaderEnd : 1;       /**< \brief transmit header end */
    uint8 txResponseEnd : 1;     /**< \brief transmit response end */
    uint8 rxHeaderEnd : 1;       /**< \brief receive header end */
    uint8 rxResponseEnd : 1;     /**< \brief receive response end */
    uint8 txCompleted : 1;       /**< \brief transmission completed */
} IfxAsclin_Lin_AcknowledgementFlags;

/** \brief Structure for Baudrate Detection
 */
typedef struct
{
    boolean abd;              /**< \brief LINCON.ABD, autobaud detection enable */
    uint8   lowerLimit;       /**< \brief BRD.LOWERLIMIT, auto baudrate detection lowerlimit */
    uint8   upperLimit;       /**< \brief BRD.UPPERLIMIT, auto baudrate detection upperlimit */
    uint8   measured;         /**< \brief BRD.MEASURED, measured time interval between the
                               * first and the fifth falling edge of the sync byte */
} IfxAsclin_Lin_BaudrateDetection;

/** \brief Structure for Baudrate Generation
 */
typedef struct
{
    float32 baudrate;          /**< \brief value of the required baudrate */
    uint16  numerator;         /**< \brief BRG.NUMERATOR, defines the numerator of fractional divider */
    uint16  denominator;       /**< \brief BRG.DENOMINATOR, defines the denominator of fractional divider */
} IfxAsclin_Lin_BaudrateGeneration;

/** \brief Structure for Bit Sampling
 */
typedef struct
{
    uint8                         filterDepth;               /**< \brief IOCR.DEPTH, digital glitch filter depth */
    IfxAsclin_SamplesPerBit       medianFilter;              /**< \brief BITCON.SM, no. of samples per bit 1 or 3 */
    IfxAsclin_SamplePointPosition samplePointPosition;       /**< \brief BITCON.SAMPLEPOINT, sample point position */
} IfxAsclin_Lin_BitSamplingControl;

/** \brief Structure for Bit Timing
 */
typedef struct
{
    uint16                       prescaler;          /**< \brief BITCON.PRESCALER, predivider to generate the baud rate */
    IfxAsclin_OversamplingFactor oversampling;       /**< \brief BITCON.OVERSAMPLING, postdivider, used for oversampling */
} IfxAsclin_Lin_BitTimingControl;

/** \brief Structure for Data Control
 */
typedef struct
{
    IfxAsclin_DataLength             dataLength;                /**< \brief DATCON.DATALENGTH, data length, number of bits per transfer */
    IfxAsclin_HeaderResponseSelect   headerOnly;                /**< \brief DATCON.HO, Lin frame with header and response or header only */
    IfxAsclin_LinResponseTimeoutMode responseTimeoutMode;       /**< \brief DATCON.RM, response mode (response or frame timeout threshold) */
    IfxAsclin_Checksum               checksum;                  /**< \brief DATCON.CSM, checksum mode (classic or enhanced) */
    uint16                           responseTimeout;           /**< \brief DATCON.RESPONSE, timeout limit */
} IfxAsclin_Lin_DataControl;

